artillery_result_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:10:37(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:10:38(-0300)

All VUs finished. Total time: 15 seconds

--------------------------------
Summary report @ 16:10:48(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 46
  max: ......................................................................... 543
  median: ...................................................................... 267.8
  p95: ......................................................................... 407.5
  p99: ......................................................................... 441.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6619.8
  max: ......................................................................... 7275.6
  median: ...................................................................... 7117
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 7260.8